Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Loop statements allow a block of code to be executed repeatedly, branch statements allow a certain block of code to be executed only when certain conditions are met, and control transfer statements provide a way to alter the order in which code is executed.
ja: ループ文はコードの１ブロックが繰り返して実行されるようにします、分岐文はコードの特定のブロックを特定の条件が満たされるときにだけ実行されるようにします、そして制御移動文はコードが実行される順番を変える方法を提供します。

source: Loop statements allow a block of code to be executed repeatedly, depending on the conditions specified in the loop.
ja: ループ文は、ループにおいて指定される条件に従って、コードの１ブロックを繰り返して実行するようにします。

source: Make an existing type conform to a protocol
ja: 既存の型をプロトコルに準拠させる

source: Make another subclass of NamedShape called Circle that takes a radius and a name as arguments to its initializer.
ja: NamedShapeの別のサブクラス、Circleと呼ばれるものを作ってください、それはそのイニシャライザに対する引数として半径と名前をとるものです。

source: Marking a class as open explicitly indicates that you’ve considered the impact of code from other modules using that class as a superclass, and that you’ve designed your class’s code accordingly.
ja: あるクラスを明示的に開放とすることが指し示すのは、あなたが、そのクラスをスーパークラスとして使っている、他のモジュール由来のコードの影響を考慮に入れるということです、そしてあなたがあなたのクラスのコードをそれに従って設計するということです。

source: Marking a closure with @escaping means you have to refer to self explicitly within the closure.
ja: あるクロージャを@escapingで印することは、あなたがそのクロージャ内部でselfを明示的に参照しなければならないのを意味します。

source: Marking a structure or enumeration as frozen gives up this flexibility to gain performance: Future versions of the library can make only limited changes to the type, but the compiler can make additional optimizations in code that interacts with the type’s members.
ja: 構造体または列挙を凍結されると印することは、この柔軟性を諦めることで性能を手に入れます：ライブラリの将来のバージョンは、制限された変更だけしか型に対して出来ません、しかしコンパイラは追加的な最適化を、型のもつメンバーと相互作用するコードにすることが出来ます。

source: Marking the protocol as class-only lets the SnakesAndLadders class later in this chapter declare that its delegate must use a weak reference.
ja: プロトコルをクラス専用とすることは、SnakesAndLaddersクラスに後でこの章においてその委任先が弱い参照を使わなければならないことを宣言させます。

source: Matched values in a switch case can be bound to temporary constants or variables for use within the case’s body, and complex matching conditions can be expressed with a where clause for each case.
ja: あるswitchケース節においてマッチされた値は、そのケース節内の本文で使われるために一時的な定数や変数に結び付けられることができます、そして複雑なマッチ条件が各ケース節に対してwhere節を使って表わされることができます。

source: Matching Enumeration Values with a Switch Statement
ja: 列挙値をスイッチ文で照合する

source: Members of a superclass that have this modifier and don’t have the final modifier can be overridden by subclasses.
ja: この修飾子を持つそしてfinal修飾子を持たないスーパークラスのメンバーは、サブクラスによってオーバーライドされることができます。

source: Memberwise Initializers for Structure Types
ja: 構造体型のためのメンバー関連イニシャライザ

source: Memory Safety
ja: メモリ安全

source: Memory for a new instance of that class is allocated.
ja: そのクラスの新しいインスタンスに対するメモリが割り当てられます。

source: Memory is managed automatically.
ja: メモリは、自動的に管理される。

source: Memory safety is the desired guarantee, but exclusive access is a stricter requirement than memory safety—which means some code preserves memory safety, even though it violates exclusive access to memory.
ja: メモリ安全は望まれる保証です、しかし排他アクセスはメモリ安全より厳格な要件です — それが意味するのは、あるコードはたとえそれがメモリに対する排他アクセスを破るとしてもメモリ安全を守るということです。

source: Metatype Type
ja: メタタイプ型

source: Method Requirements
ja: メソッド要件

source: Methods
ja: メソッド

source: Methods associated with a type rather than an instance of a type must be marked with the static declaration modifier for enumerations and structures, or with either the static or class declaration modifier for classes.
ja: ある型のインスタンスとではなく、ある型と結び付けられるメソッドは、列挙と構造体ではstatic宣言修飾子で、またクラスではstaticまたはclassどちらかの宣言修飾子で印されなければなりません。

source: Methods on a subclass that override the superclass’s implementation are marked with override—overriding a method by accident, without override, is detected by the compiler as an error.
ja: あるサブクラスのメソッドで、そのスーパークラスの実装をオーバーライド（再定義）するものは、overrideで印を付けられます ― overrideなしで、偶然にメソッドをオーバーライドすることは、コンパイラによってエラーとして検出されます。

source: Methods on an enumeration or a structure that modify self must be marked with the mutating declaration modifier.
ja: 列挙または構造体でのselfを修正するメソッドは、mutating宣言修飾子で印されなければなりません。

source: Methods that override a superclass method must be marked with the override declaration modifier.
ja: スーパークラスのメソッドをオーバーライドするメソッドは、override宣言修飾子で印されなければなりません。

source: Methods with Special Names
ja: 特殊名を持つメソッド

source: Methods, properties, or subscripts that you add to a class in an extension can also be marked as final within the extension’s definition.
ja: あなたがある拡張においてクラスに加えるメソッド、プロパティ、または添え字は、また、拡張の定義内で最終版として印されることができます。

source: Modify the anyCommonElements(_:_:) function to make a function that returns an array of the elements that any two sequences have in common.
ja: 共通したなんらかの２つの連続物である要素たちをもつある配列を返す関数になるように、anyCommonElements(_:_:)関数を修正してください。

source: Modifying Value Types from Within Instance Methods
ja: 値型をインスタンスメソッド内から修正する

source: Modules and Source Files
ja: モジュールとソースファイル

source: More generally, any unqualified method and property names that you use within the body of a type method will refer to other type-level methods and properties.
ja: より一般的に言えば、あなたがある型メソッドの本文内で使うどんな非修飾のメソッドやプロパティ名でも、他の型レベルのメソッドやプロパティに言及します。

source: Moreover, IntStack specifies that for this implementation of Container, the appropriate Item to use is a type of Int.
ja: さらに、IntStackは、Containerのこの実施のために、適切なItemとして使用するのはInt型であることを示します。

source: Most code should use the objc attribute instead, to expose only the declarations that are needed.
ja: ほとんどのコードは、objc属性を代わりに使って、必要とされる宣言だけを露出するべきです。

source: Most memory access is instantaneous.
ja: ほとんどのメモリアクセスは即時的です。

source: Most of the time, a type identifier directly refers to a named type with the same name as the identifier.
ja: ほとんどの場合、型識別子は、名前付きの型に、その識別子と同じ名前で直接に言及します。

source: Multiline String Literals
ja: 複数行文字列リテラル

source: Multiline comments begin with /* and end with */.
ja: 複数行コメントは/*で始まり*/で終わります。

source: Multiline comments start with a forward-slash followed by an asterisk (/*) and end with an asterisk followed by a forward-slash (*/):
ja: 複数行コメントは、スラッシュに続く星印（/*）で始まり、星印に続くスラッシュ（*/）で終わります：

source: Multiline string literals that you create using extended delimiters have the same indentation requirements as regular multiline string literals.
ja: あなたが拡張区切り記号を使って作成する複数行文字列リテラルは、通常の複数行文字列リテラルと同じ字下げ要件を持ちます。

source: Multiple accesses to a location in memory at the same time can produce unpredictable or inconsistent behavior.
ja: メモリの同じ位置への同時での複数のアクセスは、予期されないまたは一貫性のない挙動を生じ得ます。

source: Multiple cases can appear on a single line, separated by commas:
ja: 複数のケース節は、コンマで区切られて、ただ１つの行に現れることができます：

source: Multiple extensions on a concrete type can’t add conformance to the same protocol, even if the extensions’ requirements are mutually exclusive.
ja: ある具象型上の複数の拡張は、同じプロトコルに対して準拠を加えることはできません、たとえそれら拡張の持つ要件が相互に排他的であるとしてもです。

source: Multiple optional bindings can now appear in a single if statement as a comma-separated list of assignment expressions.
ja: 複数のオプショナル束縛は、今では単一のif文においてコンマ区切りの代入式のリストとして現れることができます。

source: Multiple protocols can be listed, and are separated by commas:
ja: 複数のプロトコルが、コンマで区切られて、リストされることができます：

source: Multiple queries can be chained together, and the entire chain fails gracefully if any link in the chain is nil.
ja: 複数の問い合わせが一緒に鎖で繋げられることができます、そして連鎖の中のどれかの輪がnilならば、その連鎖全体がいさぎよく失敗します。

source: Multiple switch cases that share the same body can be combined by writing several patterns after case, with a comma between each of the patterns.
ja: 同じ本文を共有する複数のケース節は、caseの後にそれぞれのパターンを、それぞれのパターンの間のコンマとともに書くことによって結合されることができます。

source: Multiplication (*)
ja: 乗算（*）

source: Mutability of Collections
ja: コレクションの可変性

source: Mutating Instance Methods
ja: 変更インスタンスメソッド

source: Mutating Method Requirements
ja: 変更メソッド要件

source: Mutating methods can assign an entirely new instance to the implicit self property.
ja: 変更メソッドは、まったく新しいインスタンスを暗黙のselfプロパティに代入することができます。

source: Mutating methods for enumerations can set the implicit self parameter to be a different case from the same enumeration:
ja: 列挙のための変更メソッドは、暗黙のselfパラメータを同じ列挙からの異なるケース節に設定することができます：

source: Named types include classes, structures, enumerations, and protocols.
ja: 名前付きの型は、クラス、構造体、列挙、そしてプロトコルを含みます。

source: Naming Constants and Variables
ja: 定数と変数に名をつける

source: Naming Type Parameters
ja: 型パラメータに名をつける

source: Negative floating-point literals are expressed by prepending a minus sign (-) to a floating-point literal, as in -42.5.
ja: 負の浮動小数点数は、浮動小数点リテラルに単項マイナス演算子（-）を前につけることによって表わされます、-42.5のように。

source: Negative integers literals are expressed by prepending a minus sign (-) to an integer literal, as in -42.
ja: 負整数リテラルは、負符号（-）をリテラル整数の前に付けることによって表されます、-42のように。

source: Negative numbers, however, are stored differently.
ja: 負の数は、しかし異なって格納されます。

source: Neither parameter is marked @escaping, so they’re both nonescaping as a result.
ja: どちらのものも@escapingと印されません、それでそれらは両方とも非脱出です。

source: Neither type of formatting affects the underlying value of the literal:
ja: 書式整形のどちらの種類も、もととなるリテラルの値に影響を及ぼしません：

source: Nested Functions
ja: 入れ子にされた関数

source: Nested Types
ja: 入れ子にされた型

source: Nested Types in Action
ja: 入れ子にされた型の動作

source: Nested functions are closures that have a name and can capture values from their enclosing function.
ja: 入れ子にされた関数は、名前を持ち、それを囲んでいる関数から値を捕獲することができるクロージャです。

source: Nested functions are hidden from the outside world by default, but can still be called and used by their enclosing function.
ja: 入れ子にされた関数は、初期状態では外界から隠されます、しかしそれにもかかわらず、それらを囲む関数によって呼び出されて使われることができます。

source: Nested functions have access to variables that were declared in the outer function.
ja: 入れ子にされた関数は、外側の関数において宣言された変数に、アクセスをします。

source: Nested functions, as introduced in Nested Functions, are a convenient means of naming and defining self-contained blocks of code as part of a larger function.
ja: 入れ子にされた関数は、入れ子にされた関数の中で紹介されるように、より大きい関数の一部として、いろいろな完全独立のコードの塊を名前をつけて定義する便利な手段です。

source: Nested multiline comments enable you to comment out large blocks of code quickly and easily, even if the code already contains multiline comments.
ja: 入れ子にされた複数行コメントによって、たとえコードがすでに複数行コメントを含むとしても、あなたは速く簡単にコードの大きなブロックをコメントアウトすることが可能になります。

source: Nested types defined within a public type have an automatic access level of internal.
ja: 公開型の内側で定義される入れ子にされた型は、自動的なアクセス水準として内部を持ちます。

source: Nesting multiline comments is allowed, but the comment markers must be balanced.
ja: 複数行コメントが入れ子にされることは許されます、しかしコメント目印が釣り合っている必要があります。

source: Nevertheless, the return value always has the same underlying type of [T], so it follows the requirement that functions with opaque return types must return values of only a single type.
ja: それにもかかわらず、戻り値は常に同じ基礎をなす型の[T]を持ちます、それでそれは、不透明戻り型をもつ関数はもっぱら単一の型の値だけを返さなければならないという要件に従います。

source: New document that describes Swift 1.0, Apple’s new programming language for building iOS and OS X apps.
ja: iOSおよびOS Xアプリ構築のためのAppleの新しいプログラミング言語、スウィフト 1.0を解説する新しい文書。

source: New operators are declared at a global level using the operator keyword, and are marked with the prefix, infix or postfix modifiers:
ja: 新しい演算子はoperatorキーワードを使ってグローバル水準で宣言されます、そしてprefix、infixまたはpostfix修飾子で印されます：

source: Next, tenEighty is assigned to a new constant, called alsoTenEighty, and the frame rate of alsoTenEighty is modified:
ja: 次に、tenEightyは、新しい定数、alsoTenEightyと呼ばれるものに代入されます、そしてalsoTenEightyのフレームレートが修正されます：

source: Next, the width property of cinema is amended to be the width of the slightly wider 2K standard used for digital cinema projection (2048 pixels wide and 1080 pixels high):
ja: 次に、cinemaのwidthプロパティは、デジタル映画館投影のために使われるわずかにより広い2Kの標準の幅（2048ピクセル幅の広さで1080ピクセルの高さ）になるように改められます：

source: Nil-Coalescing Operator
ja: nil合体演算子

source: No Implicit Fallthrough
ja: 知らずに突き抜けない（フォールスルーしない）

source: No further code from the current iteration of the loop is executed, and no further iterations of the loop are started.
ja: ループの現在の繰り返しからそれ以上のコードは実行されません、そしてループのそれ以上の繰り返しは始まりません。

source: No ladder on the board takes the player straight to square 25, and so it isn’t possible to win the game by moving up a ladder.
ja: 盤上のはしごは、プレーヤーをまっすぐ正方形25に連れて行きません、なので、はしごを上がることでゲームに勝つことは可能ではありません。

source: No other properties or variables are still referring to the Player instance, and so it is deallocated in order to free up its memory.
ja: 他のいかなるプロパティまたは変数も、もはやPlayerインスタンスに言及していません、なのでそれは、それのもつメモリを開放するために順次割り当て解除されます。

source: Nonassociative operators of the same precedence level can’t appear adjacent to each to other.
ja: 同じ優先順位レベルを持つ非結合演算子は、互いに隣同士に現れることができません。

source: Nonetheless, because it’s of type TextRepresentable, and anything that is TextRepresentable is known to have a textualDescription property, it’s safe to access thing.textualDescription each time through the loop.
ja: それでもなお、それがTextRepresentable型であり、そして、TextRepresentableであるもの全てがtextualDescriptionプロパティを持つと知られているので、それがループの各回でthing.textualDescriptionにアクセスするのは安全です。

source: Nonetheless, class B provides an override of someMethod() with an access level of “internal”, which is higher than the original implementation of someMethod():
ja: それにもかかわらず、クラスBは、「内部」のアクセス水準を持つsomeMethod()のオーバーライドを提供します、それは元々のsomeMethod()の実装よりもより高いです：

source: Nonetheless, it is useful for a Cuboid to provide a read-only computed property to enable external users to discover its current calculated volume.
ja: それでもなお、Cuboidが外部のユーザーにその現在の計算された体積を見つけられるように読み出し専用の計算プロパティを提供することは、役に立ちます。

source: Nonetheless, many parts of Swift will be familiar from your experience of developing in C and Objective-C.
ja: にもかかわらず、スウィフトの多くの部分は、あなたのCとObjective-Cでの開発経験からきっとお馴染みのものでしょう。

source: Nonetheless, the Item alias provides a way to refer to the type of the items in a Container, and to define a type for use with the append(_:) method and subscript, to ensure that the expected behavior of any Container is enforced.
ja: それでもなお、Itemエイリアスは、Containerの中の項目の型に言及するための、そしてappend(_:)メソッドと添え字で使うための型を定義するための、ひとつの方法を提供します、それによってあらゆるContainerが期待される挙動を強制されることを確実にします。

source: Nonetheless, they’re all classes, and so instances of all three types can be used to initialize an array that stores values of type AnyObject:
ja: それでもなお、それらは全てクラスです、なので、３つの型全てのインスタンスは、型AnyObjectの値を格納するある配列を初期化するために使用できます：

source: Nonetheless, you can still make the types explicit if you wish, and doing so is encouraged if it avoids ambiguity for readers of your code.
ja: それでもなお、あなたが望むならば、依然としてあなたは型を明確にすることができます、そして、それがあなたのコードの読者のために曖昧さを避けるならば、そうすることは推奨されます。

source: Nonetheless, you can use protocols as a fully fledged types in your code.
ja: それにもかかわらず、あなたはプロトコルを完全に一人前の型としてあなたのコードにおいて使用できます。

source: Nonreturning functions and methods either cause an irrecoverable error or begin a sequence of work that continues indefinitely.
ja: 非復帰関数およびメソッドは、回復不能のエラーを起こすかまたは無期限に続く一連の作業を始めるかのどちらかです。

source: Nor can they begin with a number, although numbers may be included elsewhere within the name.
ja: そしてそれらは数字から始まることもできません、けれども数字が名前内のどこか他で含まれることはできます。

source: Nor can you change a constant into a variable or a variable into a constant.
ja: そして、あなたはある定数を変数に、またはある変数を定数に変更することもできません。

source: Not all possible Int values will find a matching planet, however.
ja: しかし、全ての可能なInt値が、適合する惑星を見つけるというわけでありません。

source: Not equal to (a != b)
ja: 同等でない (a != b)

source: Not every type in Swift can be compared with the equal to operator (==).
ja: スウィフトの中のすべての型が、同等演算子（==）で比較されることができるというわけでありません。

source: Not identical to (!==)
ja: 同一でない（!==）

source: Not only are optionals safer and more expressive than nil pointers in Objective-C, they’re at the heart of many of Swift’s most powerful features.
ja: オプショナルはObjective-Cでのnilポインターより安全でさらに表現豊かであるだけでなく、それはスウィフトのたくさんある非常に強力な特徴のうち核心的なものです。

source: Note
ja: 注意

source: Note also that you cannot provide both an overriding setter and an overriding property observer for the same property.
ja: あなたが同じプロパティに対してオーバーライドしたセッターとオーバーライドしたプロパティオブザーバーの両方を提供することができない点にまた、注意してください。

source: Note how the generic version of Stack is essentially the same as the nongeneric version, but with a type parameter called Element instead of an actual type of Int.
ja: Stackの総称体版が、本質的にどれほど非総称体版と同じものであるかに注意してください、しかしElementと呼ばれる型パラメータを実際の型Intの代わりに持つことは除きます。

source: Note that tenEighty and alsoTenEighty are declared as constants, rather than variables.
ja: tenEightyとalsoTenEightyが、変数ではなく、定数として宣言される点に注意してください。

source: Note that x and y are an optional of whatever type someThrowingFunction() returns.
ja: xとyは、たとえどんなものでもsomeThrowingFunction()が返す型のオプショナルです。

source: Note that @objc protocols can be adopted only by classes that inherit from Objective-C classes or other @objc classes.
ja: @objcプロトコルがObjective-Cクラスや他の@objcクラスから継承するクラスによってのみ採用される点に注意してください。

source: Note that identical to (represented by three equals signs, or ===) doesn’t mean the same thing as equal to (represented by two equals signs, or ==).
ja: 同一である（３つの等号、つまり===によって表されるもの）は同等である（２つの等号、つまり==によって表されるもの）と同じことを意味しないのに注意してください。

source: Note that two levels of optional chaining are at play here.
ja: ここで２つの階層のオプショナル連鎖が働いていることに注意してください。

source: Note that Swift infers a type of String for the someString constant because it’s initialized with a string literal value.
ja: スウィフトが型StringをsomeString定数に対して推論することに注意してください、それが文字列リテラル値で初期化されるためです。

source: Note that Swift’s use of extended grapheme clusters for Character values means that string concatenation and modification may not always affect a string’s character count.
ja: スウィフトのCharacter値に対する拡張書記素クラスタの使用は、文字列の連結と修正が常に文字列の文字数に影響を与えないことを意味します。

source: Note that an exclamation point (!) is used to unwrap and access the instances stored inside the john and unit4A optional variables, so that the properties of those instances can be set:
ja: 感嘆符（!）が使われることに注意してください、そうすることでオプショナル変数のjohnとunit4Aに格納されるインスタンスがアンラップされてアクセスされるようになります、それでそれらのインスタンスのプロパティが設定されることができます：

source: Note that if you define a custom initializer for a value type, you will no longer have access to the default initializer (or the memberwise initializer, if it is a structure) for that type.
ja: あなたがある値型のためにあつらえのイニシャライザを定義するならば、あなたがもはやその型の省略時のイニシャライザに（および、それが構造体の場合には、メンバー関連イニシャライザにも）アクセスをしない点に注意してください。

source: Note that if you override a failable superclass initializer with a nonfailable subclass initializer, the only way to delegate up to the superclass initializer is to force-unwrap the result of the failable superclass initializer.
ja: 注意することは、あなたが失敗できるスーパークラス・イニシャライザを、失敗できないサブクラス・イニシャライザでオーバーライドする場合、唯一の方法としてスーパークラスのイニシャライザにまで委任するには、失敗できるスーパークラスイニシャライザの結果を強制アンラップすることです。

source: Note that in the example above, you are trying to retrieve the value of the street property.
ja: 上の例で、あなたがstreetプロパティの値を取り出そうとしている点に注意してください。

source: Note that it is not possible to call these initializers without using argument labels.
ja: 引数ラベルを使用することなくこれらのイニシャライザを呼び出すことは可能でない点に注意してください。

source: Note that neither deinitializer was called when you set these two variables to nil.
ja: あなたがこれらの２つの変数をnilに設定したとき、どちらのデイニシャライザも呼ばれなかった点に注意してください。

source: Note that no whitespace may appear between the type and the !.
ja: 空白が型と!の間に現れないことに注意してください。

source: Note that no whitespace may appear between the type and the ?.
ja: 空白が型と?の間に現れないことに注意してください。

source: Note that not all 21-bit Unicode scalar values are assigned to a character—some scalars are reserved for future assignment or for use in UTF-16 encoding.
ja: 全ての21ビットのユニコードスカラー値がひとつの文字に割り当てられる訳ではないことに注意してください ― いくつかのスカラーは将来の割り当てのためにまたはUTF-16符号化で使うために取っておかれます。

source: Note that the delegate property is defined as an optional DiceGameDelegate, because a delegate isn’t required in order to play the game.
ja: delegateプロパティが、オプショナルのDiceGameDelegateとして定義される点に注意してください、delegateがゲームをプレイするために必須でないからです。

source: Note that the thing constant is of type TextRepresentable.
ja: thing定数が型TextRepresentableであることに注意してください。

source: Note that the array contains four items, but 0..<count only counts as far as 3 (the index of the last item in the array), because it’s a half-open range.
ja: この配列が４つの項目を含む点に注意してください、しかし0..<countは3（この配列の最後の項目のインデックス）まで数えるだけです、なぜならそれが半開範囲であるためです。

source: Note that the closure’s end curly brace is followed by an empty pair of parentheses.
ja: クロージャの閉じ波括弧に、一対の空の丸括弧が続くことに注意してください。

source: Note that the declaration of parameters and return type for this inline closure is identical to the declaration from the backward(_:_:) function.
ja: 行内クロージャのためのパラメータと戻り型の宣言が、backward(_:_:)関数の宣言と同一であることに注意してください。

source: Note that the entire function type is wrapped in the optional, not the method’s return value.
ja: メソッドの戻り値ではなく、その関数型の全体がオプショナルの中のラップされることに注意してください。

source: Note that the message "John Appleseed is being initialized" is printed at the point that you call the Person class’s initializer.
ja: あなたがPersonクラスのイニシャライザを呼んだ時点で、メッセージ"John Appleseed is being initialized"が出力されるという点に注意してください。

source: Note that the message in the HTMLElement deinitializer is not printed, which shows that the HTMLElement instance is not deallocated.
ja: HTMLElementデイニシャライザにおけるメッセージが出力されないことに注意してください、それは、HTMLElementインスタンスが割り当て解除されないことを示します。

source: Note that the names of someInt and anotherInt are prefixed with an ampersand when they are passed to the swapTwoInts(_:_:) function:
ja: someIntとanotherIntの名前が、それらがswapTwoInts(_:_:)関数に渡される時に、アンパサンドで接頭辞を付けられるという点に注意してください：

source: Note that the return type of this function is still Int?, because the function returns an optional index number, not an optional value from the array.
ja: この関数の戻り型が以前としてInt?であるという点に注意してください、なぜなら、この関数がオプショナルのインデックス番号（配列からのオプショナルの値でない）を返すからです。

source: Note that the tuple’s members do not need to be named at the point that the tuple is returned from the function, because their names are already specified as part of the function’s return type.
ja: タプルの構成要素が、タプルがその関数から返される時点で名前をつけられる必要がない点に注意してください、なぜなら、それらの名前が関数の戻り型の一部としてすでに指定されるからです。

source: Note that the type of customerProvider is not String but () -> String—a function with no parameters that returns a string.
ja: 注意すべきは、customerProviderの型はStringではなく() -> String — ある文字列を返すパラメータのない関数 — であることです。

source: Note that the type of the someInts variable is inferred to be [Int] from the type of the initializer.
ja: someInts変数の型が、そのイニシャライザの型から[Int]であると推測される点に注意してください。

source: Note that the underlying objects aren’t changed by the casting process.
ja: 根底にあるオブジェクトがキャスト処理によって変更されない点に注意してください。

source: Note that this extension doesn’t define a type parameter list.
ja: この拡張は型パラメーターリストを定義しないことに注意してください。

source: Note that this function is distinct from the greet(person:) function shown in an earlier section.
ja: この関数が前の節で見せたgreet(person:)関数と別個のものであることに注意してください。

source: Note that this is true even though numberOfRooms is a non-optional Int.
ja: たとえnumberOfRoomsが非オプショナルのIntであるとしても、これが当てはまることに注意してください。

source: Note that you can assign an explicit access level for both a getter and a setter if required.
ja: あなたは明示的なアクセス水準をゲッターとセッターの両方に割り当てることが、必要ならば可能です。

source: Note that you cannot call a mutating method on a constant of structure type, because its properties cannot be changed, even if they are variable properties, as described in Stored Properties of Constant Structure Instances:
ja: あなたが定数の構造体型で変更メソッドを呼ぶことができないということに注意してください、なぜなら、定数構造体インスタンスの格納プロパティで記述されるように、そのプロパティは、たとえそれらが変数プロパティであるとしても変わることができないからです。

source: Note that, because Optional is implemented as an enumeration, .none and .some can appear in the same switch as the cases of the enumeration type.
ja: 注意することとして、Optionalが列挙として実装されることから、.noneと.someが同じスイッチ文の中に列挙型のケース節として現れることが可能です。

source: Nothing else is required of the instance you assign to this property, except that the instance must adopt the RandomNumberGenerator protocol.
ja: そのインスタンスがRandomNumberGeneratorプロトコルを採用しなければならないことをのぞいては、あなたがこのプロパティに代入するところのインスタンスに必要とされるものは他に何もありません。

source: Notice how let can be used in a pattern to assign the value that matched the pattern to a constant.
ja: どのようにletがパターン内で使われて、パターンに合致した値を定数に割り当てることができるかに注意してください。
